newwms_gift/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <basedOn>Document.итWMSПриемка</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSПриемка/итWMSПриемка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSПриемка</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаИзТранзита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_ДокументаТранизата</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПроверены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличныхЧастейПриПроверке</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РасхожденияПМУ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАктРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацииПримкиWMS</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>КарантинПаллеты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольнаяМарка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалМарки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяСерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаА</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеФизическогоНосителя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характиристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПомарочногоУчета</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДанныеМарокЕГАИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответсвиеДаннныхТТНиСкласдкогоУчета</name>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.алкКлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/ПоступлениеТоваровУслуг/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.итWMSПриемка") Тогда 
		ЗаполнитьПоПриемке(ДанныеЗаполнения)
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоПриемке(Приемка)
	
	итОснование=Приемка;
	Организация=Приемка.Организация;
	Контрагент=Приемка.Контрагент;
	НомерВходящегоДокумента=Приемка.НомерВходящегоДокумента;
	ДатаВходящегоДокумента=Приемка.ДатаВходящегоДокумента;
	Склад=Приемка.Склад;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSПриемкаТовары.Номенклатура КАК Номенклатура,
		|	итWMSПриемкаТовары.Характеристика КАК Характеристика,
		|	итWMSПриемкаТовары.Качество КАК Качество,
		|	итWMSПриемкаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	СУММА(итWMSПриемкаТовары.КоличествоФакт) КАК Количество
		|ИЗ
		|	Документ.итWMSПриемка.Товары КАК итWMSПриемкаТовары
		|ГДЕ
		|	итWMSПриемкаТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSПриемкаТовары.Номенклатура,
		|	итWMSПриемкаТовары.Характеристика,
		|	итWMSПриемкаТовары.Качество,
		|	итWMSПриемкаТовары.СерияНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Приемка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Товары.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтрока=Товары.Добавить();	
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	НоваяСтрока.ХарактеристикаНоменклатуры=ВыборкаДетальныеЗаписи.Характеристика;
	НоваяСтрока.Качество=?(ВыборкаДетальныеЗаписи.Качество=Справочники.Качество.ПустаяСсылка(),Справочники.Качество.Новый,ВыборкаДетальныеЗаписи.Качество);
	НоваяСтрока.ЕдиницаИзмерения=ВыборкаДетальныеЗаписи.Номенклатура.ЕдиницаХраненияОстатков;
	НоваяСтрока.Коэффициент =ВыборкаДетальныеЗаписи.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;
	КонецЦикла;
	

	
	КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Ответственный.Пустая() Тогда 
	Ответственный=	ПараметрыСеанса.ТекущийПользователь;
КонецЕсли;
Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда 
ПроверкаНаЗадвоенностьПоОснованию(Отказ);
КонецЕсли;
КонецПроцедуры


Процедура ПроверкаНаЗадвоенностьПоОснованию(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.итОснование = &итОснование
		|	И ПоступлениеТоваровУслуг.Ссылка <> &Ссылка
		|	И ПоступлениеТоваровУслуг.Проведен";
	
	Запрос.УстановитьПараметр("итОснование", итОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ=Истина;
		Сообщить("Уже есть документ по текущему основанию "+Строка(итОснование));
	КонецЦикла;
	

	
	КонецПроцедуры
